## Игорь С
Системный администратор и DevOps с 2010 года.

## Профессиональные навыки

#**Операционная система**
- Linux
- Windows (7, 8, 10, 2008 R2, 2016, 2019)] 
- FreeBSD
- MacOS

#**Веб-приложения**
- Bitrix 
- Bolt 
- Symphony (basic)

#**Веб-серверы**
- Nginx
- Apache
- IIS

#**Резервная копия**
- Bareos
- Acronis (basic)

#**Базы данных**
- MySQL (MariaDB)
- PostgreSQL
- MSSQL
- SQLite

#**Веб-сервис**
- ELK (Basic)
- ActiveMQ
- RabbitMQ

#**Инвентаризация аппаратного и программного обеспечения**
- Glpi
- OCS inventory

#**Система мониторинга**
- Icinga2
- Zabbix
- PRTG
- Grafana
- Prometheus

#**Система виртуализации**
- Vmware 
- QEMU/KVM 
- VirtualBox

#**Контейнеры, оркестризация контейнеров**
- Docker/Docker-compose
- Podman
- Kubernetes (basic)
- lxc

#**Авторизация**
- LDAP 
- Kerberos (basic) 
- AD

#**Инструменты управления сервером**
- iDRAC
- HP's iLO

#**Пакеты**
- Deb
- RPM

#**Почтовый сервер**
- Postfix 
- Dovecot 
- SOGo
- CommuniGate Pro

#**Система проксирования**
- Squid

#**Антивирус**
- Dr.Web Enterprise Server
- Kaspersky Security for Servers
- ClamAV

#**Технологии и инструменты**
- Letsencrypt
- Lsyncd
- dd
- rsync
- XMPP
- Postman
- Cerebro
- Zenity
- iptables
- Samba

#**Features:**
- Rest api
- Linux
- Load balancing and high availability
- Virtualization
- Containers
- Clouds
- Web servers
- SQL
- SSL
- Writing scripts
- Backup

#**Дополнительные инструменты/автоматизация**
- Git
- CI/CD
- Средства автоматизации
- - Ansible
- - Puppet (basic)
- Языки программирования
- - Bash
- - Powershell
- - HTML
- - Python (basic)
- - PHP (basic)
- - Perl (basic)

#**Языки**
- Russian (native)
- English (pre-intermediate)

## Работа на проектах

#**Страхование (2021)**

Проектная группа:
Менеджер,
Руководители команды разработчиков,
Команды разработчиков,
Системный администратор/DevOps,
Команды тестировщиков,
Аналитиков


Моя роль:
Системный администратор и DevOps

Задачи и особенности:
Разработка серверной архитектуры, подготовка DEV/TEST сред для разработки и тестирования, настройка CI/CD, развертывание ELK, настройка сервисов, создание задачи для системы мониторинга, резервное копирование, автоматизация различных задач информационной системы, контроль и поддержка системы мониторинга.

Технический стек:
Docker, GitLab, IIS, MSSQL, PRTG, ELK, REST API, Powershell, ActiveMQ, Windows, Linux

#**Приборостроительное предприятие военно-промышленного комплекса (2020)**

Проектная группа:
Менеджер,
Руководители команды разработчиков,
Команды разработчиков,
Системный администратор/DevOps

Моя роль:
Системный администратор и DevOps

Задачи и особенности:
Разработка серверной архитектуры, подготовка DEV/TEST/PROD сред для разработки и тестирования, настройка CI/CD, настройка сервисов, организация мер безопасности, контроль и разграничение прав доступа, управление и поддержка баз данных, автоматизация различных задач информационной системы.

Технический стек:
Docker, lxc, GitLab, IIS, Apache, MSSQL, PostgreSQL, MySQL, Icinga, Powershell, Bash, Dr.Web Enterprise Server, Windows, Linux

#**Оренбургская строительная компания (2019)**

Проектная группа:
Менеджер,
Руководитель группы разработки,
Системный администратор

Моя роль:
Системный администратор

Задачи и особенности:
Настройка сервисов, сборка и конфигурирование отдельных пакетов deb, автоматизация установки на пользовательских станциях, добавление в репозиторий.

Технический стек:
Docker, Windows, Linux, Firefox, ansible.

#**Уфимская торговая компания (2018)**

Проектная группа:
Менеджер,
Руководитель группы разработки,
Системный администратор

Моя роль:
Системный администратор и DevOps

Задачи и особенности:
Разделение сети на сегменты VLAN, разделение прав доступа с последующим сопряжением прокси и авторизации.

Технический стек:
Squid, Bind, OpenLDAP.

## Образование

2017-2025 <br>
Кандидат технических наук <br>
Удмуртский государственный университет, Ижевск <br>
Институт математики, информационных технологий и физики, математическое и программное обеспечение компьютеров, комплексов и компьютерных сетей.

2015-2017 <br>
Степень магистра <br>
Ижевский государственный технический университет им. М.Т. Калашникова, Ижевск <br>
Менеджмент и маркетинг (Стратегическое управление)

2010-2015 <br>
ВПО(Инженер) <br>
Ижевский государственный технический университет им. М.Т. Калашникова, Ижевск <br>
Информатика и вычислительная техника, Компьютеры, комплексы, системы и сети

2006-2010 <br>
СПО(Техник) <br>
Ижевский промышленно-экономический колледж <br>
Информатика и компьютерные технологии (Техническое обслуживание компьютерного оборудования и компьютерных сетей)
